#### Question 2. Understanding docker first run

In [ ]:
pip list

### Work with DB

In [318]:
pip install pandas sqlalchemy

Requirement already satisfied: pandas in /Users/zooomx/miniconda3/lib/python3.10/site-packages (2.2.0)
Requirement already satisfied: sqlalchemy in /Users/zooomx/miniconda3/lib/python3.10/site-packages (2.0.25)
Requirement already satisfied: pytz>=2020.1 in /Users/zooomx/miniconda3/lib/python3.10/site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: numpy<2,>=1.22.4 in /Users/zooomx/miniconda3/lib/python3.10/site-packages (from pandas) (1.26.3)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/zooomx/miniconda3/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: tzdata>=2022.7 in /Users/zooomx/miniconda3/lib/python3.10/site-packages (from pandas) (2023.4)
Requirement already satisfied: typing-extensions>=4.6.0 in /Users/zooomx/miniconda3/lib/python3.10/site-packages (from sqlalchemy) (4.9.0)
Requirement already satisfied: greenlet!=0.4.17 in /Users/zooomx/miniconda3/lib/python3.10/site-packages (from sqlalchemy) (3.0.3)
Requirement already satisfied: six>=1.5 in /Users/zooomx/miniconda3/lib/python3.10/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [321]:
from sqlalchemy import create_engine
import pandas as pd

In [12]:
engine = create_engine('postgresql://postgres:postgres@localhost:54399/ny_taxi')

In [13]:
engine.connect()

In [322]:
query = """
SELECT 
    * 
FROM 
    pg_catalog.pg_tables
WHERE 
    schemaname != 'pg_catalog' AND schemaname != 'information_schema';
"""

pd.read_sql(query, con=engine) # show info about tables

,schemaname,tablename,tableowner,tablespace,hasindexes,hasrules,hastriggers,rowsecurity
0,public,green_tripdata,postgres,None,True,False,False,False
1,public,taxi_zone_lookup,postgres,None,True,False,False,False

In [323]:
query = """
SELECT 
    * 
FROM 
    green_tripdata
LIMIT 2
"""

pd.read_sql(query, con=engine) # show info about tables

,index,VendorID,lpep_pickup_datetime,lpep_dropoff_datetime,store_and_fwd_flag,RatecodeID,PULocationID,DOLocationID,passenger_count,trip_distance,...,extra,mta_tax,tip_amount,tolls_amount,ehail_fee,improvement_surcharge,total_amount,payment_type,trip_type,congestion_surcharge
0,0,2,2019-09-01 00:10:53,2019-09-01 00:23:46,N,1,65,189,5,2.0,...,0.5,0.5,2.36,0.0,None,0.3,14.16,1,1,0.0
1,1,2,2019-09-01 00:31:22,2019-09-01 00:44:37,N,1,97,225,5,3.2,...,0.5,0.5,0.00,0.0,None,0.3,13.30,2,1,0.0

#### Question 3. Count records

In [324]:
query = """
SELECT 
    COUNT(*) as taxi_on_2019_09_18
FROM 
    green_tripdata
WHERE 
    to_char(lpep_pickup_datetime, 'YYYY-MM-DD') = '2019-09-18'
AND 
    to_char(lpep_dropoff_datetime, 'YYYY-MM-DD') = '2019-09-18'
"""
pd.read_sql(query, con=engine)

   taxi_on_2019_09_18
0               15612

#### Question 4. Largest trip for each day

In [325]:
query = """
SELECT 
    to_char(lpep_pickup_datetime, 'YYYY-MM-DD') as pickup_datetime
FROM 
    green_tripdata
WHERE 
    trip_distance = (
        SELECT max(trip_distance) 
        FROM green_tripdata
    )
"""
pd.read_sql(query, con=engine)

  pickup_datetime
0      2019-09-26

#### Question 5. Three biggest pick up Boroughs

In [320]:
query = """
SELECT 
    to_char(lpep_pickup_datetime, 'YYYY-MM-DD') as pickup_datetime, 
    l."Borough", 
    sum(total_amount) as total_amount 
FROM 
    green_tripdata g 
JOIN taxi_zone_lookup l
    ON g."PULocationID" = l."LocationID"
WHERE 
    to_char(lpep_pickup_datetime, 'YYYY-MM-DD') = '2019-09-18' 
GROUP BY 
    pickup_datetime, 
    l."Borough"
HAVING 
    sum(total_amount) > 50000
ORDER BY 
    total_amount DESC
"""
pd.read_sql(query, con=engine)

  pickup_datetime    Borough  total_amount
0      2019-09-18   Brooklyn      96333.24
1      2019-09-18  Manhattan      92271.30
2      2019-09-18     Queens      78671.71

#### Question 6. Largest tip

In [319]:
query = """
SELECT "Zone" 
FROM (
    SELECT 
        to_char(lpep_pickup_datetime, 'YYYY-MM') as pickup_datetime, 
        lt."Zone" as "Zone", 
        max(tip_amount) as max_tip
    FROM green_tripdata g
    JOIN taxi_zone_lookup l
        ON g."PULocationID" = l."LocationID"
    JOIN taxi_zone_lookup lt
        ON g."DOLocationID" = lt."LocationID"
    WHERE to_char(lpep_pickup_datetime, 'YYYY-MM') = '2019-09' 
        AND l."Zone" = 'Astoria'
    GROUP BY 
        pickup_datetime, 
        lt."Zone"
    ORDER BY max_tip DESC
    LIMIT 1
) as subsquary
"""
pd.read_sql(query, con=engine)

          Zone
0  JFK Airport